In [8]:
import pandas as pd

In [9]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'Florida': 19552860,
                   'Illinois': 12882135}

population = pd.Series(population_dict)

In [11]:
population.index

Index(['California', 'Florida', 'Illinois', 'Texas'], dtype='object')

In [12]:
population.values

array([38332521, 19552860, 12882135, 26448193], dtype=int64)

In [13]:
area_dict = {'California': 423967, 
             'Illinois': 149995,
              'Texas': 695662, 
             'New York': 141297,
             'Florida': 170312}

area = pd.Series(area_dict)

In [4]:
# Creating dataframes using series
states = pd.DataFrame({'population':population, 'area':area})

In [5]:
states

              area  population
California  423967  38332521.0
Florida     170312  19552860.0
Illinois    149995  12882135.0
New York    141297         NaN
Texas       695662  26448193.0

In [6]:
states['density'] = states['population'] / states['area']

In [7]:
states

              area  population     density
California  423967  38332521.0   90.413926
Florida     170312  19552860.0  114.806121
Illinois    149995  12882135.0   85.883763
New York    141297         NaN         NaN
Texas       695662  26448193.0   38.018740

In [42]:
df = pd.read_excel(r'C:\Users\ZekeLabs\Downloads\tab.xlsx',skiprows=[0,1], header=[0,1])

In [52]:
df = df.drop(df.columns[0],axis=1)

In [54]:
df = df.T

In [57]:
df = df.rename(columns=df.iloc[0])

In [63]:
df.index

MultiIndex(levels=[[2012, 2013, 2014, 'Age group', 'Corresponding Level of Education', 'Unnamed: 0_level_0', 'Unnamed: 10_level_0', 'Unnamed: 11_level_0', 'Unnamed: 12_level_0', 'Unnamed: 13_level_0', 'Unnamed: 3_level_0', 'Unnamed: 4_level_0', 'Unnamed: 6_level_0', 'Unnamed: 7_level_0'], ['ALL', 'All', 'F', 'M', 'SC', 'ST', 'T', 'Unnamed: 0_level_1', 'Unnamed: 12_level_1', 'Unnamed: 13_level_1', 'Unnamed: 1_level_1', 'Unnamed: 8_level_1']],
           labels=[[3, 1, 10, 11, 2, 12, 13, 4, 0, 6, 7, 8, 9], [10, 0, 4, 5, 1, 4, 5, 11, 3, 2, 6, 8, 9]])

In [64]:
df = pd.read_excel(r'C:\Users\ZekeLabs\Downloads\tab.xlsx',skiprows=[0,1], header=[0,1])

In [65]:
df

,Unnamed: 0_level_0,Age group,2013,Unnamed: 3_level_0,Unnamed: 4_level_0,2014,Unnamed: 6_level_0,Unnamed: 7_level_0,Corresponding Level of Education,2012,Unnamed: 10_level_0,Unnamed: 11_level_0,Unnamed: 12_level_0,Unnamed: 13_level_0
,Unnamed: 0_level_1,Unnamed: 1_level_1,ALL,SC,ST,All,SC,ST,Unnamed: 8_level_1,M,F,T,Unnamed: 12_level_1,Unnamed: 13_level_1
0,NaN,6-10 Years,130896.000,23324.000,13019.533,130647.971,23286.000,12970.798,Primary ...,68583442.0,62560241.0,131143683.0,NaN,NaN
1,NaN,11-13 Years,75223.000,13259.363,7194.112,74412.746,13127.000,7079.001,Upper Primary (VI-VIII),39946948.0,36097179.0,76044127.0,NaN,NaN
2,NaN,6-13 Years,206119.000,36583.363,20213.645,205060.717,36413.000,20049.799,Elementary ...,108530390.0,98657420.0,207187810.0,NaN,NaN
3,NaN,14-15 Years,50244.000,8802.855,4610.000,49801.492,8724.077,4558.845,Secondary (IX-X),26706389.0,23984866.0,50691255.0,NaN,NaN
4,NaN,6-15 Years,256363.000,45386.218,24823.645,254862.209,45137.077,24608.644,I-X,135236779.0,122642286.0,257879065.0,NaN,NaN
5,NaN,16-17 Years,45084.773,7748.797,3963.136,44734.006,7679.619,3937.000,Sr. Secondary ( XI-XII),24139427.0,21299011.0,45438438.0,NaN,NaN
6,NaN,6-17 Years,301447.773,53135.015,28786.781,299596.215,52816.696,28545.644,I-XII,50845816.0,45283877.0,96129693.0,IX-XII,NaN
7,NaN,18-23 Years,140802.000,24077.000,11926.000,141046.000,24106.000,11949.000,Higher Education,73294003.0,67264696.0,140558699.0,NaN,NaN
8,NaN,Data Source: Ministry of Human Resource Develo...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,